a=str(input("Язык программирования (вводим с большой буквы) : "))
if a=="C++":
    print("Появлся в 1980 году ; издатель Бьёрн Страуструп ")
elif a=="Python":
    print(" Появился в 1991 году; Автор Гвидо ван Руссум")
elif a=="R":
    print("Появился в 1993году; автор Росс Айхэка и Роберт Джентлмен")
elif a=="Pascal":
    print("Появился в 1070 году; автор Никлаус Вирт")
elif a=="Java":
    print("Появился в 1995 году; разработчики Джеймс Гослинг и Sun Microsystems ")
elif a=="JavaScript":
    print("Год появления 1995; автор Брендан Эйх")
elif a=="PHP":
    print("Появился 8 июня 1995; Разработчиком Лердроф, Расмус"
          "Гутман, Энди")
elif a=="Ruby":
    print("Разработанный Юкихиро Мацумто в 1995 году")
else:
    print("Нет такого языка программирования) или нет в базе ((")
